cipher = """В!а%с#и!л#ь$ !С@и$м%о#н$е%н!к!о!
%
!Т%и! $з@н$а!є%ш%,@ $щ!о$ !т@и$ #—@ !л%ю@д@и#н$а$.%
%Т@и@ @з#н@а@є%ш$ !п!р$о% %ц!е! $ч!и% %н!і!?%
$У#с!м@і#ш$к%а$ @т!в$о!я! !—! #є#д@и!н#а!,#
%М$у%к$а! #т!в@о@я# $—# %є#д#и%н!а!,!
#О#ч#і# !т#в!о@ї@ @—! $о#д#н!і@.!
%
$Б$і!л@ь#ш%е# @т#е$б#е# #н%е$ $б%у#д#е#.@
%З@а$в%т$р$а@ %н$а% @ц$і$й# #з@е#м!л@і$
%І#н!ш#і# !х#о#д#и!т!и%м$у#т#ь% $л!ю#д$и#,@
#І%н@ш#і# #к#о$х!а$т$и#м$у!т@ь% $л@ю$д$и@ !—#
%Д!о$б!р#і@,! $л!а!с$к#а!в@і@ $й$ #з!л%і!.#
%
%С$ь%о#г$о%д#н$і@ $у!с!е% #д@л#я% #т@е%б$е% %—$
@О$з@е#р@а$,! !г$а$ї!,# %с%т#е$п!и%.$
%І# !ж#и!т#и@ $с!п$і@ш@и%т@и# $т#р@е!б@а!,@
!К$о!х%а@т#и@ !с@п!і%ш%и!т@и! @т#р!е#б%а# !—%
@Г@л@я$д#и# #ж# !н%е% @п@р$о!с!п#и#!#
!
@Б!о@ !т#и$ %н!а@ $з@е$м@л#і! !—$ #л%ю!д$и%н@а%,@
%І@ $х#о%ч!е#ш! !т%о!г!о% @ч!и! #н#і! !—!
!У%с$м@і$ш%к%а# @т%в%о%я! !—@ $є%д$и@н$а%,!
%М$у@к!а$ #т!в!о@я% @—! $є%д@и@н#а!,@
!О@ч$і# %т!в$о%ї$ @—# !о$д#н%і$.# $"""

symbols = ["!","@","#","$","%"]

new_cipher = ""

for i in cipher:
    #print(i)
    if i not in symbols:  #  == "!" or i == "@" or i == "#" or i == "$" or i == "%":
            #index = cipher.find(i)
            #print(index)
            #cipher.replace(cipher[index],"")
            new_cipher += i
            print(i, "  Symbol is added")
    #else:
        
            

#cipher.replace("!", "")

print(new_cipher)
        
