text = """
...?ьнед ясйищюяндивзоР
,ьнего вом ,алисагз боЩ
,алинипс її угіб в боЩ
,алис яат ітівс в ед I
,анивал ясалитокоП
,анїур алз ьсалилавзоР
.репет ьситатупс ьтсад еН
.ялоп імьтіп ьтипутсу еН
– ялов ,акмуд ,акуан ,хуД
– реноіцюловер йинчіВ

.ьтуч ахуд солог ес оБ
,ьтудй одар иноіліМ
-,юобос з евз иноіліМ
юобурт вом ,миньлис моволС
;єінд ед ,идут ьтишіпс I
,єінцім ,ясьтєутсорп Iм
.едй ілис йінсалв о I
ясвивопзор арочв жа аТ
,ясвидор тіл чясит дів чоХ
!евиж ещ нів ,ремв ен ніВ

.олевз ен ещ огой бірг В
олсемер екьсноіпш іН
,інавотшал итамраг іН
,інавортшум акьсйів інА
,ирум ікьсрац інмерют іН
,ирутрот їікьсвіпоп іН
.ремв ен ещ нів ,евиж ніВ
,юлов й ятсащ ,путсоп аз евР
,юоб од евр оліт ощ ,хуД
– реноіцюловер йинчіВ

нміГ – окнарФ навІ
"""

a = ""

i = len(text)-1
while i != 0:
    a += text[i]
    i-=1
    print(a)
